import React from 'react';
import { StaticImage } from 'gatsby-plugin-image';
import Post from '@templates/Post';
import * as R from '@templates/ReusableCSS';

const Plan3 = () => {
  return (
    <Post mainTitle="12월 계획" tag="Plan" date="23.11.30" subTitle="10, 11월의 점검 및 12월의 계획">
      <StaticImage
        src="../../../../assets/imgs/plan/3.png"
        alt="post-img"
        style={{ width: '100%', height: '60vh', backgroundSize: 'contain', backgroundRepeat: 'no-repeat' }}
      />
      <R.PostContentBox>
        <h2>10, 11월 계획 점검</h2>
        <p>
          정말 <strong>너무너무너무너무너무</strong> 바빴다.
        </p>
        <p>원래 저번 달에 10월 점검 하고 이번 달에 11월 점검 해야 했는데</p>
        <p>이제서야 몰아서 하네,,</p>
        <p>미리미리 좀 합시다 제발!</p>
        <h3>우테코 지원하기</h3>
        <p>지원은 했다!</p>
        <p>끝까지 하고 싶었지만 피치 못한 사정으로 인해,, ㅋ</p>
        <p>미국가서 코딩하는 건 진짜 오바지,,</p>
        <p>지금 생각해도 미국갈 때 노트북 안 들고 간 건 너무 잘한 거 같다.</p>
        <br />
        <p>우테코 하면서도 내 실력이 많이 부족하다는 것을 느꼈다.</p>
        <p>그리고 세상엔 잘하는 사람이 너무나도 많구나도 느꼈다.</p>
        <p>정말 갈 길이 먼 거 같다.</p>
        <br />
        <p>JS 공부를 진짜 해야 하는데 언제 할련지,,</p>

        <h3>SOPT의 모든 활동 빠지지 않기</h3>
        <p>흠흠,, 진짜 하려고 했는데,,</p>
        <p>생각보다 할 게 너무 많아서</p>
        <p>또 미국 가느라,,</p>
        <p>큼큼,,,</p>
        <p>앱잼 가기 전엔 다 해야지,, 정말로</p>

        <h3>1일 1알고리즘</h3>
        <p>그냥 알고리즘 하지 말까보다,,</p>
        <p>너무 하기 싫은데 어떡하지,,?</p>

        <h3>주 5회 운동 목표</h3>
        <p>흐,, 또 변명이지만</p>
        <p>진짜로 너무 바빴다.</p>
        <p>운동 너무 하고 싶었는데</p>
        <p>진짜루 진짜 바빴어,,</p>
        <br />
        <p>근데 지금 생각해 보면 그냥 핸드폰 할 시간 모아서</p>
        <p>그 시간에 운동 1시간 땡기고 왔으면 어땠을까 싶기도 하지만</p>
        <p>사실 그게 진짜 어려운 거니까,,</p>

        <h3>JS, TS 끝장내기</h3>
        <p>ㅎ,, 하나도 안 함.</p>

        <h3>영어 회화 공부</h3>
        <p>ㅋ,, 이것도 안 함.</p>
        <p>나는 그럼 뭘 했던 걸까?</p>
        <p>덕분에 미국 가서 말도 잘 못하고 ㅎㅎ</p>

        <h3>개발 블로그 발전시키기</h3>
        <p>블로그를 냉동 상태로 만들어 버렸다;</p>
        <p>지금 이제 막 해동 다 했으니</p>
        <p>진짜 12월 부터는 진짜 진짜 진짜</p>
        <p>부지런히 올릴 거다.</p>

        <h3>미국 여행 가기</h3>
        <p>계획을 정말 하나도 못 짜고 간 여행이었지만</p>
        <p>너무나도 재밌었다.</p>
        <p>J로써 특히 해외여행은 일정을 정말 세세하게 짜는 편인데</p>
        <p>계획을 짤 여유가 없었다.</p>
        <p>처음으로 혼자 가는 여행이라</p>
        <p>살짝 걱정도 되었지만</p>
        <p>정말 전혀 외롭지 않았고 매 순간 즐거웠다.</p>
        <p>역시 돈 펑펑 쓰면서 노는 건 짜릿해,,</p>
        <del>디즈니랜드 못 간 건 너무 아쉽지만,,</del>
        <del>근데 뭐 어쩌겠어? 또 가면 되지 :)</del>

        <h3>솝커톤 참여</h3>
        <p>참여는 했다!</p>
        <p>성공적으로 마무리 했냐는 사실 잘 모르겠다,,</p>
        <p>너무 많은 걸 느끼고 배운 거 같아</p>
        <p>참여하길 너무나도 잘했다는 생각이 든다.</p>

        <h2>12월의 계획</h2>
        <h3>앱잼 전 TS 공부 좀 하기</h3>
        <p>JS랑 TS는 진짜 해야 한다.</p>
        <p>하루에 진짜 강의 하나라도 제발 보자;</p>

        <h3>운동 해놓기</h3>
        <p>앱잼 시작하면 이제 운동 못 할 거 같으니</p>
        <p>그 전에 부지런히 해놓읍시다.</p>
        <p>일단 무산소만 할 거야.</p>
        <p>진짜 올 여름은 준비한다,,</p>

        <h3>밀린 과제 하기</h3>
        <p>미국 가느라 못 했던,</p>
        <p>바빠서 못 했던,</p>
        <p>2주차, 3주차 심화 과제 한 후 검사 맡기.</p>
        <p>심스 빠졌던 아티클 2개 댓글 달기.</p>
        <p>우리 잔디조 3주차 코리 달기.</p>
        <p>다른 웨비들 4주차 코리 달아주기.</p>

        <h3>기타,,?</h3>
        <p>기타 치고 싶은데</p>
        <p>시간이 되려나 모르겠다,,</p>

        <h3>영어 공부</h3>
        <p>흠,, 영어 공부는 어떻게 해야할까?</p>
        <p>이제 시연스쿨도 끝나서 더 안 할 거 같은데</p>
        <p>일단 시도는 해보자,,!</p>

        <h3>핸드폰 갤러리 정리하기</h3>
        <p>인스타에 사진들 다 올리고</p>
        <p>컴퓨터에 사진들 다 백업시키고</p>
        <p>갤러리 다 정리하자.</p>

        <h3>올 한 해 잘 마무리 하기</h3>
        <p>올 한 해 너무 열심히 달려왔던 거 같다.</p>
        <p>이제 얼마 안 남았지만</p>
        <p>잘 마무리 할 수 있으면 좋겠다 :)</p>
        <br />
        <strong>12월 진짜 화이팅!🔥</strong>
      </R.PostContentBox>
    </Post>
  );
};

export const Head = () => <title>plan - 12월 계획</title>;

export default Plan3;
